Autodesk.Revit.DB.BuiltInFailures.AssemblyFailures.SomeElementsPreventAssemblyTypeChange
Assembly cannot be changed to selected type. Some elements in the target assembly prevent the type change from occurring.
These tend to be parts and nested elements such as mullion, curtain panels, and members of trusses.

Autodesk.Revit.DB.BuiltInFailures.AssemblyFailures.NoEligibleElementsInAssembly
No eligible elements in assembly.

Autodesk.Revit.DB.BuiltInFailures.AssemblyFailures.NoElementsLeftInExistingAssembly
There are no elements left in the assembly. It will be disassembled.

Autodesk.Revit.DB.BuiltInFailures.AssemblyFailures.NoElementsAddedtoNewAssembly
No elements were added to the assembly. No assembly will be created.

Autodesk.Revit.DB.BuiltInFailures.AssemblyFailures.MixedPhasesInAssembly
Assembly cannot be created. All elements must have the same phases to be included in an assembly.

Autodesk.Revit.DB.BuiltInFailures.AssemblyFailures.IneligibleElementsInAssembly
Ineligible elements in assembly.

Autodesk.Revit.DB.BuiltInFailures.AssemblyFailures.ElementsNotAllowedAreNotAddedToAssembly
Elements not allowed in Assembly were not added to it, but only in the document

Autodesk.Revit.DB.BuiltInFailures.AssemblyFailures.DeleteShopDrawingsWarn
The assembly instance has associated views and cannot be merged with assembly type '%1!s!'. Delete the views to continue.\n\nViews:%2!s!

Autodesk.Revit.DB.BuiltInFailures.AssemblyFailures.DeleteAssemblyInstWithViewsWarn
Deleting this assembly will remove the assembly from the project and any views associated with that assembly.

Autodesk.Revit.DB.BuiltInFailures.AssemblyFailures.CouldNotChangeTypeOfAssembly
Assembly cannot be changed to selected type.

Autodesk.Revit.DB.BuiltInFailures.AssemblyFailures.CouldNotAcquireAssemblyViews
The assembly instance could not acquire the assembly views.

Autodesk.Revit.DB.BuiltInFailures.AssemblyFailures.AssemblyRenameTypeWarn
Edits to these assemblies changed the naming category and name of these assemblies.

Autodesk.Revit.DB.BuiltInFailures.AssemblyFailures.AssemblyNewTypeWarn
Edits to these assemblies match existing type and will inherit that name.

Autodesk.Revit.DB.BuiltInFailures.AssemblyFailures.AssemblyInvalidMember
Some elements became ineligible to be included in an assembly and were removed.

Autodesk.Revit.DB.BuiltInFailures.AssemblyFailures.AssemblyInheritTypeWarn
Edits to these assemblies do not match existing types, new type will be created.

Autodesk.Revit.DB.BuiltInFailures.AssemblyFailures.AssemblyDisassembleInstanceWarn
Edits to these assemblies changed the naming category and name of these assemblies.

Autodesk.Revit.DB.BuiltInFailures.AssemblyFailures.AssemblyDidNotMatchRequestedTypeWarn
Assembly was changed to a new type, but did not match the type. Geometry could have been changed due to a join condition.

Autodesk.Revit.DB.BuiltInFailures.AssemblyFailures.AssemblyDeleteTypeWarn
Edits to these assemblies changed the naming category and name of these assemblies.

Autodesk.Revit.DB.BuiltInFailures.AssemblyFailures.AddedElementsNotSamePhaseAsAssembly
Selected Element(s) cannot be added to the assembly. Elements must have the same phases as the assembly to be included in the assembly.

Autodesk.Revit.DB.BuiltInFailures.AssemblyFailures
Failures related to Assemblies.